{"1": "A man visits the doctor. The doctor says \"I have bad news for you.You have\ncancer and Alzheimer's disease\". \nThe man replies \"Well,thank God I don't have cancer!\"\n", "2": "This couple had an excellent relationship going until one day he came home\nfrom work to find his girlfriend packing. He asked her why she was leaving him\nand she told him that she had heard awful things about him. \n\n\"What could they possibly have said to make you move out?\" \n\n\"They told me that you were a pedophile.\" \n\nHe replied, \"That's an awfully big word for a ten year old.\" \n", "3": "Q. What's 200 feet long and has 4 teeth? \n\nA. The front row at a Willie Nelson Concert.\n", "4": "Q. What's the difference between a man and a toilet? \n\nA. A toilet doesn't follow you around after you use it.\n", "5": "Q.\tWhat's O. J. Simpson's Internet address? \nA.\tSlash, slash, backslash, slash, slash, escape.\n", "6": "Bill & Hillary are on a trip back to Arkansas. They're almost out of gas, so Bill pulls into a service station on the outskirts of\ntown. The attendant runs out of the station to serve them when Hillary realizes it's an old boyfriend from high school. She and\nthe attendant chat as he gases up their car and cleans the windows. Then they all say good-bye. \n\nAs Bill pulls the car onto the road, he turns to Hillary and says, 'Now aren't you glad you married me and not him ? You could've\nbeen the wife of a grease monkey !' \n\nTo which Hillary replied, 'No, Bill. If I would have married him, you'd be pumping gas and he would be the President !' \n", "7": "How many feminists does it take to screw in a light bulb?\nThat's not funny.\n", "8": "Q. Did you hear about the dyslexic devil worshiper? \n\nA. He sold his soul to Santa.\n", "9": "A country guy goes into a city bar that has a dress code, and the maitre\nd' \ndemands he wear a tie. Discouraged, the guy goes to his car to sulk when \ninspiration strikes: He's got jumper cables in the trunk! So he wraps\nthem around his neck, sort of like a string tie (a bulky string tie to be\nsure) and returns to the bar. The maitre d' is reluctant, but says to the\nguy, \"Okay, you're a pretty resourceful fellow, you can come in... but\njust don't start anything\"!  \n", "10": "Two cannibals are eating a clown, one turns to other and says: \n\"Does this taste funny to you? </UL>\n", "11": "Q. What do a hurricane, a tornado, and a redneck\ndivorce all have in common? \nA. Someone's going to lose their trailer...\n", "12": "A guy stood over his tee shot for what seemed an eternity, looking up, looking down, measuring the distance,\nfiguring the wind direction and speed. Driving his partner nuts.\n\nFinally his exasperated partner says, \"What the hell is taking so long? Hit the goddamn ball!\"\nThe guy answers, \"My wife is up there watching me from the clubhouse. I want to make this a perfect shot.\"\n\"Well, hell, man, you don't stand a snowball's chance in hell of hitting her from here!\" \n", "13": "They asked the Japanese visitor if they have elections in his\ncountry.  \n\"Every Morning\" he answers.\n", "14": "The father was very anxious to marry off his only daughter so he wanted \nto impress her date. \"Do  you like to screw,\" he says. \"Huh\" replied the \nsurprised first date. \"My daughter she loves to screw and she's good at it, \nyou and her  should go screw,\" carefully explained the father. Now very \ninterested the boy replied, \"Yes, sir.\" Minutes later the girl came down \nthe stairs, kissed her father goodbye and the couple left. After only a \nfew minutes she reappeared, furious, dress torn, hair a mess and screamed\n\"Dammit, Daddy, it's the TWIST, get it straight!\" \n", "15": "Q:  What did the blind person say when given some matzah?\n\nA:  Who the hell wrote this?\n", "16": "Q. What is orange and sounds like a parrot?  \n\nA. A carrot.\n", "17": "How many men does it take to screw in a light bulb? \n\nOne...men will screw anything. \n", "18": "A dog walks into Western Union and asks the clerk to send a telegram. He fills out a form on which he\nwrites down the telegram he wishes to send: \"Bow wow wow, Bow wow wow.\"\n\nThe clerk says, \"You can add another 'Bow wow' for the same price.\"\n\nThe dog responded, \"Now wouldn't that sound a little silly?\" \n", "19": "Q: If a person who speaks three languages is called \"tri-lingual,\" and\na person who speaks two languages is called \"bi-lingual,\" what do call\na person who only speaks one language?\n\nA: American! \n", "20": "What's the difference between a MacIntosh and an\nEtch-A-Sketch? \n\nYou don't have to shake the Mac to clear the screen. \n", "21": "What's the difference between a used tire and 365 used condoms?\n\nOne's a Goodyear, the other's a great year.\n", "22": "A duck walks into a pharmacy and asks for a condom. The pharmacist says\n\"Would you like me to stick that on your bill?\"\nThe duck says: \n\"What kind of duck do you think I am!\"\n", "23": "Q: What is the Australian word for a boomerang that won't\n   come back? \n\nA: A stick\n", "24": "What do you get when you run over a parakeet with a lawnmower? \nShredded tweet.\n", "25": "Two kindergarten girls were talking outside: one said, \"You\nwon't believe what I saw on the patio yesterday--a condom!\"\n\nThe second girl asked, \"What's a patio?\"\n", "26": "A guy walks into a bar and sits down next to an extremely gorgeous \nwoman.  The first thing he notices about her though, are her pants.  \nThey were skin-tight, high-waisted and had no obvious mechanism \n(zipper, buttons or velcro) for opening them.\n\nAfter several minutes of puzzling over how she got the pants up over \nher hips, he finally worked up the nerve to ask her.  \"Excuse me miss, \nbut how do you get into your pants?\"\n\n\"Well,\" she replied, \"you can start by buying me a drink.\"\n", "27": "Clinton returns from a vacation in Arkansas and walks down  the\nsteps of Air Force One with two pigs under his arms.  At the bottom\nof the steps, he says  to the honor guardsman, \"These are genuine\nArkansas Razor-Back Hogs.  I got this one for Chelsea and this one for\nHillary.\"  \n\nThe guardsman replies, \"Nice trade, Sir.\"\n", "28": "A mechanical, electrical and a software engineer from Microsoft were\ndriving through the desert when the car broke down. The mechanical\nengineer said \"It seems to be a problem with the fuel injection system,\nwhy don't we pop the hood and I'll take a look at it.\" To which the\nelectrical engineer replied, \"No I think it's just a loose ground wire,\nI'll get out and take a look.\" Then, the Microsoft engineer jumps in.\n\"No, no, no. If we just close up all the windows, get out, wait a few\nminutes, get back in, and then reopen the windows everything will work\nfine.\"\n", "29": "An old Scotsmen is sitting with a younger Scottish gentleman and says the boy. \n\"Ah, lad look out that window. You see that stone wall there, I built it with\nme own bare hands, placed every stone meself.  But do they call me MacGregor the\nwall builder? No! \n\nHe Takes a few sips of his beer then says, \"Aye, and look out on that lake and \neye that beautiful pier. I built it meself, laid every board and hammered each\nnail but do they call me MacGregor the pier builder? No! \n\nHe continues...\"And lad, you see that road? That too I build with me own bare \nhands. Laid every inch of pavement meself, but do they call MacGregor the road\nbuilder? No!\"\n\nAgain he returns to his beer for a few sips, then says, \n\"Agh, but you screw one sheep...\"\n", "30": "Q: What's the difference between a Lawyer and a Plumber? \nA: A Plumber works to unclog the system.\n", "31": " President Clinton looks up from his desk in the Oval Office to see\n one of his aides nervously approach him. \n \"What is it?\" exclaims the President. \n\"It's this Abortion Bill Mr. President, what do you want to do\n about it?\" the aide replies. \n\"Just go ahead and pay it.\" responds the President. \n", "32": "A man arrives at the gates of heaven. St. Peter asks, \"Religion?\" \nThe man says, \"Methodist.\" St. Peter looks down his list, and says, \n\"Go to room 24, but be very quiet as you pass room 8.\" \n\nAnother man arrives at the gates of heaven. \"Religion?\"\n\"Baptist.\" \"Go to room 18, but be very quiet as you pass room 8.\" \n\nA third man arrives at the gates. \"Religion?\" \"Jewish.\"\n\"Go to room 11, but be very quiet as you pass room 8.\" \nThe man says, \"I can understand there being different rooms for different religions, but why\nmust I be quiet when I pass room 8?\" St. Peter tells him, \"Well the Catholics are in room 8, \nand they think they're the only ones here.\n", "33": "What do you call an American in the finals of the world cup?\n\n\"Hey Beer Man!\"\n", "34": "Out in the backwoods of some midwestern state, little Johnny arrives\nat school an hour late.\n\nTeacher: \"Why are you so late, John?\"\nJohny : \"My big brother got shot in the ass.\"\n(the teacher corrects his speech)\nTeacher: \"Rectum.\"\nJohnny : \"Wrecked him!? Hell, It damn near killed him!\" \n", "35": "An explorer in the deepest Amazon suddenly finds himself surrounded\nby a bloodthirsty group of natives. Upon surveying the situation, he\nsays quietly to himself, \"Oh God, I'm screwed.\" \n\nThe sky darkens and a voice booms out, \"No, you are NOT\nscrewed. Pick up that stone at your feet and bash in the head of the\nchief standing in front of you.\" \n\nSo with the stone he bashes the life out of the chief. Standing above\nthe lifeless body, breathing heavily looking at 100 angry natives... \n\nThe voice booms out again, \"Okay ..... NOW you're screwed.\" \n", "36": "A guy walks into a bar, orders a beer and says to the bartender,\n\"Hey, I got this great Polish Joke...\" \n\nThe barkeep glares at him and says in a warning tone of voice:\n\"Before you go telling that joke you better know that I'm Polish, both\nbouncers are Polish and so are most of my customers\"\n\n\"Okay\" says the customer,\"I'll tell it very slowly.\" \n", "37": "A Jewish young man was seeing a psychiatrist for an eating and\nsleeping disorder. \n\n\"I am so obsessed with my mother... As soon as I go to sleep, I start\ndreaming, and everyone in my dream turns into my mother. I wake up in\nsuch a state, all I can do is go downstairs and eat a piece of toast.\"\n\nThe psychiatrist replies:\n\n\"What, just one piece of toast, for a big boy like you?\"\n", "38": "\"May I take your order?\" the waiter asked. \n\n\"Yes, how do you prepare your chickens?\" \n\n\"Nothing special sir,\" he replied. \"We just tell them straight out\nthat they're going to die.\"\n", "39": "What is the difference between men and women:\n\n\nA woman wants one man to satisfy her every need.\nA man wants every woman to satisfy his one need.\n", "40": "How many Irishmen does it take to change a lightbulb?\n\nTwo, one to hold the lightbulb and the other to drink until the room spins. \n", "41": "What does an atheist say during an orgasm?\n\"Oh Darwin! Oh Darwin!...\"\n", "42": "Two men are discussing the age old question: who enjoys sex more, the\nman or the woman?  A woman walks by and listens in for awhile and then\ninterrupts: \n\"Listen you guys. You know when your ear itches and you put in your \nlittle finger and wiggle it around for awhile?  Afterward,\nwhich feels better, your finger or your ear?\"\n", "43": "Arnold Swartzeneger and Sylvester Stallone are making a movie about\nthe lives of the great composers.  \nStallone says \"I want to be Mozart.\" \nSwartzeneger says: \"In that case...  I'll be Bach.\"\n", "44": "A horse walks into a bar. Bartender says:\n\"So, why the long face?\"\n", "45": "A boy comes home from school and tells his mother that he got a part\nin the school play.  \"What part?\" the mother asked. \"I play a Jewish\nhusband,\" the boy replied.  \n\"Go back to school and tell your teacher that you want a speaking role!\"\n", "46": "A couple has been married for 75 years. For the husband's 95th\nbirthday, his wife decides to surprise him by hiring a prostitute.\nThat day, the doorbell rings. The husband uses his walker to get to\nthe door and opens it. \nA 21-year-old in a latex outfit smiles and\nsays, \"Hi, I here to give you super sex!\" \nThe old man says, \"I'll take the soup.\"\n", "47": "There was an engineer who had an exceptional gift for fixing all \nthings mechanical.  After serving his company loyally for over 30 \nyears, he happily retired.  Several years later the company contacted \nhim regarding a seemingly impossible problem they were having with \none of their multi-million dollar machines. They had tried everything and \neveryone else to get the machine fixed, but to no avail.  In \ndesperation, they called on the retired engineer who had solved so \nmany of their problems in the past.\nThe engineer reluctantly took the challenge.  He spent a day studying \nthe huge machine.  At the end of the day, he marked a small \"x\" in \nchalk on a particular component of the machine and proudly stated, \n\"This is where your problem is\".\nThe part was replaced and the machine worked perfectly again. The \ncompany received a bill for $50,000 from the engineer for his \nservice.They demanded an itemized accounting of his charges. The \nengineer responded briefly:\nOne chalk mark                       $1 \nKnowing where to put it            $49,999\nIt was paid in full and the engineer retired again in peace. \n", "48": "The graduate with a Science degree asks, \"Why does it work?\"\nThe graduate with an Engineering degree asks, \"How does it work?\"\nThe graduate with an Accounting degree Asks, \"How much will it cost?\" \nThe graduate with a  Liberal Arts degree asks, \"Do you want fries \nwith  that?\"\n", "49": "Three engineering students were gathered together discussing the\npossible designers of the human body.  \nOne said, \"It was a mechanical engineer. Just look at all the joints.\"  \nAnother said, \"No, it was an electrical engineer.  The nervous systems many thousands of electrical\nconnections.\"  \nThe last said, \"Actually it was a civil engineer. Who else would run a toxic waste pipeline through a recreational area?\"\n", "50": "A guy goes into confession and says to the priest, \"Father, I'm 80 years\nold, widower, with 11 grandchildren. Last night I met two beautiful flight\nattendants. They took me home and I made love to both of them. Twice.\"\n\nThe priest said: \"Well, my son, when was the last time you were in\nconfession?\"\n \"Never Father, I'm Jewish.\"\n \"So then, why are you telling me?\"\n \"I'm telling everybody.\"\n", "51": "Did you hear that Clinton has announced there is a new national bird?  \nThe spread eagle.\n", "52": "Q: What do Monica Lewinsky and Bob Dole have in common?\nA: They were both upset when Bill finished first.\n", "53": "One Sunday morning William burst into the living room and said,\n\"Dad! Mom! I have some great news for you! I am getting married\nto the most beautiful girl in town. She lives a block away and\nher name is Susan.\"\nAfter dinner, William's dad took him aside. \"Son, I have to talk\nwith you. Your mother and I have been married 30 years.. She's a\nwonderful wife but she has never offered much excitement in the\nbedroom, so I used to fool around with women a lot. Susan is\nactually your half-sister, and I'm afraid you can't marry her.\"\nWilliam was heart-broken. After eight months he eventually\nstarted dating girls again. A year later he came home and very\nproudly announced, \"Dianne said yes! We're getting married in\nJune.\"\nAgain his father insisted on another private conversation and\nbroke the sad news. \"Dianne is your half-sister too, William. I'm\nawfully sorry about this.\"\nWilliam was furious! He finally decided to go to his mother with\nthe news.\n\"Dad has done so much harm.. I guess I'm never going to get\nmarried,\"  he complained. \"Every time I fall in love, Dad tells\nme the girl is my half-sister.\"\nHis mother just shook her head. \"Don't pay any attention to what\nhe says, dear. He's not really your father.\"\n", "54": "The Pope dies and, naturally, goes to heaven. He's met by the reception\ncommittee, and after a whirlwind tour he is told that he can enjoy any\nof the myriad of recreations available.\nHe decides that he wants to read all of the ancient original text of the\nHoly Scriptures, so he spends the next eon or so learning languages.\nAfter becoming a linguistic master, he sits down in the library and\nbegins to pour over every version of the Bible, working back from most\nrecent \"Easy Reading\" to the original script.\nAll of a sudden there is a scream in the library. The Angels come\nrunning in only to find the Pope huddled in his chair, crying to himself\nand muttering, \"An 'R'! The scribes left out the 'R'.\" \nA particularly concerned Angel takes him aside, offering comfort, asks\nhim what the problem is and what does he mean. \nAfter collecting his\nwits, the Pope sobs again, \"It's the letter 'R'. They left out the 'R'.\nThe word was supposed to be CELEBRATE!\"\n", "55": "A woman has twins, and gives them up for adoption.  One of\nthem goes to a family in Egypt and is named \"Amal.\"  The other goes to\na  family in Spain; they name him \"Juan.\"  Years later, Juan sends a\npicture of himself to his mom.  Upon receiving the picture, she tells\nher husband that she wishes she also had a picture of Amal.  \nHer husband responds, \"But they are twins-if you've seen Juan, you've\nseen   Amal.\n", "56": "A man and Cindy Crawford get stranded on a desert island.  After a couple\nof days they fall in love and start sleeping together.  Time pass the\nman seems frustrated, Cindy asks if there is anything she can do?  He\nsays there is one thing, \"Could you put on this baseball cap and go to\nthe other side of the island and answer me when I call you Bob?\"  She\nagrees.  Next day he is walking on the other side of the island, runs\ninto her and says \"Hi Bob!\"  \nShe says \"Hello, what's up?\"  \nHe replies: \"Bob you won't believe it: I've been sleeping with Cindy\nCrawford for the past two weeks!!!!\"\n", "57": "Why are there so many Jones's in the phone book?\nBecause they all have phones.\n", "58": "How many teddybears does it take to change a lightbulb?\n\nIt takes only one teddybear, but it takes a whole lot of lightbulbs.\n", "59": "The Chukcha (Russian Eskimo) phones up the Russian Parliament Building.  \nA guard answers. \nChukcha:  \"What is required to become Parliament member?\"\nGuard:  \"What are you, an idiot?\"\nChukcha:  \"Is it required?\"\n", "60": "What did the Buddhist say to the hot dog vendor?\nMake me one with everything.\n", "61": "During a recent publicity outing, Hillary sneaked off to visit a\nfortune teller of some local repute.  In a dark and hazy room, peering\ninto a crystal ball, the mystic delivered grave news.\n\"There's no easy way to say this, so I'll just be blunt: Prepare\nyourself to be a widow.  Your husband will die a violent and horrible\ndeath this year.\"\nVisibly shaken, Hillary stared at the woman's lined face, then at \nthe single flickering candle, then down at her hands.  She took a few \ndeep breaths to compose herself.  She simply had to know.  She met the\nfortune teller's gaze, steadied her voice, and asked her question.\n\"Will I be acquitted?\"\n", "62": "A group of  managers were given the assignment to measure the\nheight of a flagpole. So they go out to the flagpole with ladders\nand tape measures, and they're falling off the ladders, dropping\nthe tape measures - the whole thing is just a mess.\nAn engineer comes along and sees what they're trying to do,\nwalks over, pulls the flagpole out of the ground, lays it flat,\nmeasures it from end to end, gives the measurement to one of the\nmanagers and walks away.\nAfter the engineer has gone, one manager turns to another and\nlaughs. \"Isn't that just like an engineer, we're looking for the \nheight and he gives us the length.\"\n", "63": "An engineer, a physicist and a mathematician are sleeping in a\nroom. There is a fire in the room. The engineer wakes up, sees the fire,\npicks up the bucket of water and douses the fire and goes back to\nsleep. \n\nAgain there is fire in the room. This time, the physicist wakes\nup, notices the bucket, fills it with water, calculates the optimal\ntrajectory and douses the fire in minimum amount of water and goes\nback to sleep. \n\nAgain there is fire. This time the mathematician wakes up. \nHe looks at the fire, looks at the bucket and the water and\nexclaims, \"A solution exists\" and goes back to sleep.\n", "64": "What is the rallying cry of the International Dyslexic Pride movement?\nDyslexics Untie!\n", "65": "Two Rednecks were seated at the end of a bar when a young lady\nseated a few stools up began to choke on a piece of hamburger.  She was\nturning blue and obviously in serious respiratory distress.\nOne said to the other, \"That gal there is having a bad time!\" \nThe other agreed and said \"Think we should go help?\"  \"You bet,\" said the\nfirst,and with that, he ran over and said, \"Can you breathe??\"  She shook\nher head no.  He said, \"Can you speak??\"  She again shook her head no.\nWith that, he pulled up her skirt and licked her on the butt.\nShe was so shocked, she coughed up the obstruction and began to\nbreathe-with great relief.\nThe redneck walked back to his\nfriend and said, \"Funny how that hind lick maneuver always works.\"\n", "66": "A lawyer opened the door of his BMW, when suddenly a car came along\nand hit the door, ripping it off completely.  When the police arrived\nat the scene, the lawyer was complaining bitterly about the damage to\nhis precious BMW.  \n\"Officer, look what they've done to my Beeeeemer!!!\", he whined.  \n\"You lawyers are so materialistic, you make\nme sick!!!\"  retorted the officer.  \"You're so worried about your\nstupid BMW, that you didn't even notice that your left arm was ripped\noff!!!\"  \n\"Oh my gaaaad...\", replied the lawyer, finally noticing the\nbloody left shoulder where his arm once was.  \"Where's my\nRolex???!!!!\"\n", "67": "Once upon a time, two brooms fell in love and decided to get married.\nBefore the ceremony, the bride broom informed the groom broom that \nshe was expecting a little whiskbroom. The groom broom was aghast!\n\n\"How is this possible?\" he asked. \"We've never swept together!\n", "68": "A man piloting a hot air balloon discovers he has wandered off course and\nis hopelessly lost. He descends to a lower altitude and locates a man\ndown on the ground. He lowers the balloon further and shouts \"Excuse me,\ncan you tell me where I am?\"\n\nThe man below says: \"Yes, you're in a hot air balloon, about 30 feet\nabove this field.\"\n\n\"You must work in Information Technology,\" says the balloonist.\n\n\"Yes I do,\" replies the man. \"And how did you know that?\"\n\n\"Well,\" says the balloonist, \"what you told me is technically correct,\nbut of no use to anyone.\"\n\nThe man below says, \"You must work in management.\"\n\n\"I do,\" replies the balloonist, \"how did you know?\"\n\n\"Well,\" says the man, \"you don't know where you are, or where you're\ngoing, but you expect my immediate help. You're in the same position you\nwere before we met, but now it's my fault!\"\n\n", "69": "This guys wife asks, \"Honey if I died would you remarry?\" and he replies,\n\"Well, after a considerable period of grieving, we all need\ncompanionship, I guess I would.\"\n\nShe then asks, \"If I died and you remarried, would she live in this\nhouse?\" and he replies, \"We've spent a lot of time and money getting this\nhouse just the way we want it. I'm not going to get rid of my house, I\nguess she would.\"\n\n\"If I died and you remarried, and she lived in this house, would she\nsleep in our bed?\" and he says, \"That bed is brand new, we just paid two\nthousand dollars for it, it's going to last a long time, I guess she\nwould.\"\n\nSo she asks, \"If I died and you remarried, and she lived in this house,\nand slept in our bed, would she use my golf clubs?\"\n\n\"Oh no, she's left handed.\"\n", "70": "Employer to applicant: \"In this job we need someone who is responsible.\"\n\nApplicant: \"I'm the one you want. On my last job, every time anything\nwent wrong, they said I was responsible.\"\n\n", "71": "At a recent Sacramento PC Users Group meeting,\na company was demonstrating its latest speech-\nrecognition software.   A representative from the\ncompany was just about ready to start the\ndemonstration and asked everyone in the room\nto quiet down.\n\nJust then someone in the back of the room yelled,\n*\"Format C: Return.\"*\n\nSomeone else chimed in:\n*\"Yes, Return\"*\n\nUnfortunately, the software worked.\n\n", "72": "On the first day of college, the Dean addressed the students,\npointing out some of the rules:\n\n\"The female dormitory will be out-of-bounds for all male students\nand the male dormitory to the female students. Anybody caught breaking\nthis rule will be finded $20 the first time.\" He continued, \"Anybody \ncaught breaking this rule the second time will be fined $60. Being caught\na third time will cost you a fine of $180. Are there any questions ?\"\n\nAt this point, a male student in the crowd inquired:\n*\"How much for a season pass ?\"*\n", "73": "Q: What is the difference between George  Washington, Richard Nixon,\nand Bill Clinton?\n\nA: Washington couldn't tell a lie, Nixon couldn't   tell the truth, and\nClinton doesn't know the *difference*.\n", "74": "Q: How many stalkers does it take to change a light bulb?\n\nA: *Two*. One to replace the bulb, and the other to watch it day and night.\n", "75": "Q: Do you know the difference between an intelligent male and the\nSasquatch?\n\nA: *There have been actual reported sightings of the Sasquatch*.\n", "76": "There once was a man and a woman that both  got in  a terrible car wreck. Both of their vehicles  \nwere completely destroyed, buy fortunately, no one  was   hurt.  In thankfulness, the woman said to the \nman, 'We are both okay, so we should celebrate. I have   a  bottle of wine in my car, let's open it.'         \nSo the woman got the bottleout of the car, and  handed it to the man. The man took a really big drink, \nand handed the woman the bottle. The  woman  closed the bottle and put it down. The man  asked,  \n'Aren't you going to take a drink?' \n\nThe woman cleverly replied, \n*'No, I think I'll  just  wait for the cops to get here.'*\n", "77": "If pro- is the opposite of con- then congress must be the *opposite*\nof progress.\n", "78": "Q: What's the difference between the government  and  the Mafia?\n\nA: *One of them is organized*.\n", "79": "Q: Ever wonder why the IRS calls it Form 1040?\n\nA: Because for every $50 that you earn, *you get 10 and they get 40*.\n", "80": "Hillary, Bill Clinton and the Pope are sitting together on an airplane.\n\nBill says \"I could throw one thousand dollar bill out of this plane and\nmake one person very happy.\"\n\nHillary says \"I could throw 10 hundred dollar bills out of the plane and\nmake 10 people very happy.\"\n\nThe Pope chips in and says \"*I could throw Bill out of the airplane and make the whole \ncountry happy*.\"\n", "81": "An Asian man goes into a New York CityBank to exchange 10,000 yen for\nAmerican Currency.  The teller gives him $72.00.  The next month the\nAsian man goes into the same bank with 10,000 yen and receives $62.00.\nHe asks, \"How come? Only $62.00?\" The teller says \"Fluctuations-\nFluctuations!\"\n\nWhereupon the Asian man looks back at the teller and says \"*Fluk you\nAmelicans too*!\"\n", "82": "Q: How do you keep a computer programmer in the \nshower all day long?\n\nA: Give them a shampoo with a label that says\n*\"rinse, lather, repeat\"*.\n", "83": "*What a woman says*:\n\n\"This place is a mess!  C'mon,\nYou and I need to clean up,\nYour stuff is lying on the floor and\nyou'll have no clothes to wear,\nif we don't do laundry right now!\"\n\n*What a man hears*:\n\nblah, blah, blah, blah, *C'mon*\nblah, blah, blah, blah, *you and I*\nblah, blah, blah, blah, *on the floor*\nblah, blah, blah, blah, *no clothes*\nblah, blah, blah, blah, *RIGHT NOW!*\n", "84": "Q: What is the difference between Mechanical Engineers and Civil \nEngineers?\n \nA: Mechanical Engineers build *weapons*, Civil Engineers build *targets*.\n", "85": "Q: How many Presidents does it take to screw in a light bulb?\n\nA: *It depends upon your definition of screwing a light bulb*.\n", "86": "A neutron walks into a bar and orders a drink.\n\"How much do I owe you?\" the neutron asks.\n\nThe bartender replies, *\"for you, no charge.\"*\n", "87": "A man, recently completing a routine physical examination receives a\nphone call from his doctor.  The doctor says, \"I have some good news and\nsome bad news.\"  The man says, \"OK, give me the good news first.\"  The\ndoctor says, \"The good news is, you have 24 hours to live.\"  The man\nreplies, \"Shit!  That's the good news?  Then what's the bad news?\"\n\nThe doctor says, \"The bad news is, I forgot to call you *yesterday*.\"\n", "88": "A Czechoslovakian man felt his eyesight was growing steadily worse, and \nfelt it was time to go see an optometrist. \n\nThe doctor started with some simple testing, and showed him a standard eye \nchart with letters of\ndiminishing size: CRKBNWXSKZY. . . \n\n\"Can you read this?\" the doctor asked. \n\n\"Read it?\" the Czech answered. *\"Doc, I know him!\"*\n", "89": "*A radio conversation of a US naval \nship with Canadian authorities ... *\n\nAmericans: Please divert your course 15 degrees to the North to avoid a\ncollision.\n\nCanadians: Recommend you divert YOUR course 15 degrees to the South to \navoid a collision.\n\nAmericans: This is the Captain of a US Navy ship.  I say again, divert \nYOUR course.\n\nCanadians: No.  I say again, you divert YOUR course.\n\nAmericans: This is the aircraft carrier USS LINCOLN, the second largest ship in the United States' Atlantic Fleet. We are accompanied by three destroyers, three cruisers and numerous support vessels. I demand that you change your course 15 degrees north, that's ONE FIVE DEGREES NORTH, or counter-measures will be undertaken to ensure the safety of this ship.\n\nCanadians: *This is a lighthouse.  Your call*.\n", "90": "Q: How many programmers does it take to change a lightbulb?\n\nA: *NONE!   That's a hardware problem....*\n", "91": "A Panda bear walks into a bar.  Sits down at a table and orders a beer \nand a double cheeseburger.  After he is finished eating, he pulls out a gun\nand rips the place with gunfire.  Patrons scatter and dive under chairs and\ntables as the bear runs out the door.  After ensuring that no one is hurt, \nthe bartender races out the door, and calls after the bear \"What the hell did\nyou do that for?\"  The bear calls back, \"I'm a Panda bear.  Look it up in the\ndictionary.\"  \n\nThe bartender returns, pulls out his dictionary.\n\npanda : \\Pan\"da\\, n. (Zo[\"o]l.)\nA small Asiatic mammal (Ailurus fulgens) having fine soft fur.\nIt is related to the bears, and inhabits the mountains of Northern India.\n*Eats shoots and leaves.*\n", "92": "Early one morning a mother went to her sleeping son and woke him up.\n\n\"Wake up, son.  It's time to go to school.\" \n\"But why, Mama?  I don't want to go to school.\" \n\"Give me two reasons why you don't want to go to school.\" \n\"One, all the children hate me. Two, all the teachers hate me,\" \n\"Oh! that's no reason. Come on, you have to go to school,\" \n\n\"Give me two good reasons WHY I should go to school?\" \n \n\"One, you are *fifty-two* years old. Two, you are the *principal* of the\n school.\"\n", "93": "Reaching the end of a job interview, the human resources person asked a\nyoung engineer fresh out of Stanford,\n\n\"And what starting salary were you looking for?\"\n\nThe engineer said, \"In the neighborhood of $125,000 a year, depending\non the benefits package.\"\n\nThe interviewer said, \"Well, what would you say to a package of 5-weeks \nvacation, 14 paid holidays, full medical and dental, company matching \nretirement fund to 50% of salary, and a company car leased every 2 years - \nsay, a red Corvette?\"\n\nThe Engineer sat up straight and said, \"Wow! Are you *kidding*?\"\n\nAnd the interviewer replied, *\"Yeah, but you started it.\"*\n", "94": "Two atoms are walking down the street when one \natom says to the other \n\"Oh, my! I've lost an electron!\"\n\nThe second atom says\"Are you sure\"\n\nThe first replies *\"I'm positive!\"*\n", "95": "Just a thought ..\n\nBefore criticizing someone, walk a mile in their shoes.  \n\nThen when you do criticize them, \n*you will be a mile away and have their shoes !*\n", "96": "Two attorneys went into a diner and ordered two drinks.  Then they produced \nsandwiches from their briefcases and started to eat.  The owner became\nquite concerned and marched over and told them, *\"You can't eat your own\nsandwiches in here!\"*\n\nThe attorneys looked at each other, shrugged their shoulders and then\n*exchanged* sandwiches.\n", "97": "A teacher is explaining to her class how different languages use \nnegatives differently.  She says, \"In all languages, a positive followed\nby a negative or a negative followed by a positive makes a negative.  In\nsome languages, two negatives together make a positive, while in others they\nmake a negative.  But in no language do two positives make a negative.\"  \n\nOne of the students puts up his hand and says, *\"Yeah, right.\"*\n", "98": "Age and Womanhood\n\n1. Between the ages of 13 and 18 ...\n    *She is like Africa, virgin and unexplored.* \n\n2. Between the ages of 19 and 35 ...\n    *She is like Asia, hot and exotic.* \n\n3. Between the ages of 36 and 45 ...\n    *She is like America, fully explored, breathtakingly beautiful,and free with her resources.*\n\n4. Between the ages of 46 and 56 ...\n    *She is like Europe, exhausted but still has points of interest.* \n\n5. After 56 she is like Australia ...\n    *Everybody knows it's down there, but who gives a damn?*\n", "99": "A bus station is where a bus stops.\nA train station is where a train stops.\n\nOn *my* desk I have a *work station...*\n", "100": "Q: Whats the difference between greeting a Queen and greeting the\nPresident of the United  States?\n\nA: You only have to get on *one knee* to greet the queen.\n"}